docs/Algebra.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Algebra</title>
<!-- 2018-08-29 wo 13:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Yellowflash" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Algebra</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Law of composition, associativity and commutativity</a>
<ul>
<li><a href="#sec-1-1">1.1. Law of composition</a></li>
<li><a href="#sec-1-2">1.2. Composition of ordered sequence of elements</a></li>
<li><a href="#sec-1-3">1.3. Associative laws</a></li>
<li><a href="#sec-1-4">1.4. Stable subsets and induced laws</a></li>
<li><a href="#sec-1-5">1.5. Permutable elements, commutative law</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Law of composition, associativity and commutativity</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Law of composition</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Given a set \(E\) with a function \(f\) from \(E \times E\) to \(E\) is called law of composition.
</li>
<li>A value \(f(x,y)\) for \(x,y \in E\) is called composition of \((x,y)\).
</li>
<li>A set with a law of composition is called magma.
</li>
<li>Let \(E\) be a magma \(+\) denoting the law of composition, then the magma with the composition law \((x,y) \rightarrow y + x\) is called opposite magma.
</li>
<li>Given \((A, .)\) and \((B, +)\) be two magmas, the function \(f\) from \(A \rightarrow B\) is called homomorphism if \(f(x . y) = f(x) + f(y)\) for all \(x,y \in A\).
</li>
<li>If \(A = B\) in above definition its called endomorphism.
</li>
<li>If \(f\) is one-to-one and onto its called isomorphism.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Composition of ordered sequence of elements</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>A finite family of elements of \(E\) whose indexing set \(I\) is totally ordered is called ordered sequence of elements.
</li>
<li>Given \((x_{\alpha})_{\alpha \in A}\) be the ordered sequence of elements of magma \(E\) whose indexing set \(A\) is non-empty.
<ul class="org-ul">
<li>The composition of such ordered sequence of elements \(\Sigma_{\alpha \in A} x_{\alpha}\) is inductively defined on the number of elements of \(A\) .
</li>
<li>\(= x_{\beta}\) if \(A = \{\beta\}\)
</li>
<li>\(= x_{\beta} + \Sigma_{\alpha \in A'} x_{\alpha}\) where \(\beta\) is the smallest element and \(A' = A - \{\beta\}\)  (With the same ordering).
</li>
</ul>
</li>
<li>Homomorphism preserves composition of ordered sequences (Proof?)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Associative laws</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>A law of composition \(+\) in \(E\) is called associative if \(x + (y + z) = (x + y) + z\) for all \(x,y,z \in E\).
</li>
<li>Opposite law of an associative law is associative.
</li>
<li>Associativity theorem (Partition order sequences in a such that each partition is ordered too, then by associativity the composition on orginal sequence is same as composition of the composition of individual partitions)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Stable subsets and induced laws</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>A subset \(A\) of \(E\) is called stable subset if \(x + y \in A\) for all \(x, y \in A\)
</li>
<li>Such a subset with induced composition law is called submagma.
</li>
<li>Intersection of family of stable subsets is stable (Proof?).
</li>
<li>Smallest stable subset containing a given subset \(X\) is said to generated by \(X\).
</li>
<li>Let \(E\) and \(F\) be two magmas and \(f\) be a homomorphism between them then,
<ul class="org-ul">
<li>Image of stable subset of \(E\) by \(f\) is a stable subset of \(F\).
</li>
<li>Inverse image of a stable subset of \(F\) by \(f\) is a stable subset of \(E\).
</li>
<li>If \(X\) is subset of \(E\) the image of stable subset of \(E\) is same as the stable subset generated by \(f(X)\)
</li>
<li>If \(g\) is another homomorphism, then the set of elements \(x \in E\) such that \(f(x) = g(x)\) forms a stable subset.
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Permutable elements, commutative law</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Given magma \((E, +)\), \(x,y \in E\) is said to commute if \(x + y = y + x\) 
</li>
<li>A magma is said to be commutative if every pair of elements commute.
</li>
<li>A commutative law is equal to its opposite.
</li>
<li>Let \(X\) be a subset of \(E\) then if set of element of <b>\(E\)</b> which commutes with each element of \(X\) is called centralizer of \(X\).
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yellowflash</p>
<p class="date">Created: 2018-08-29 wo 13:49</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
